Repository: TokenPayEng/oderopay-ios
Catalog: Sources/OderoPay/Resources/*.lproj/Localizable.strings
Languages: az, ru, tr

source: Total Price
az: Toplam qiymət
ru: Общая цена
tr: Toplam Tutar

source: Payment Method
az: Ödəniş üsulu
ru: Метод Оплаты
tr: Ödeme Yöntemİ

source: Credit Card or Debit Card
az: Kredit Kartı və ya Debet Kartı
ru: Кредитная или Дебетовая карта
tr: Kredi Kartı veya banka Kartı

source: Card Number
az: Kartın Nömrəsi
ru: Номер Карты
tr: Kart Numarası

source: MM/YY
az: AA/II
ru: ММ/ГГ
tr: AA/YY

# cardHolderNameSurname
source: Cardholder Name
az: Kart Sahibinin Adı
ru: Владелец Карты
tr: Kart Sahibinin Adı ve Soyadı

# installment
source: Installments
az: Taksit
ru: разделения(ий)
tr: Taksit

source: Installment Choices
az: Taksit Seçimləri
ru: Варианты Рассрочки
tr: Taksit Seçenekleri

source: Single Payment
az: Tək Ödəniş
ru: Разовый Платеж
tr: Tek Çekim

# 3dsPrompt
source: Pay using 3D Secure
az: 3D Secure istifadə edərək ödəyin
ru: Оплатить с помощью 3D Secure
tr: 3D Secure ile ödemek istiyorum

# saveCardPrompt
source: Save my card for future payments
az: Gələcək ödənişlər üçün kartımı yadda saxlayın
ru: Сохранить мою карту
tr: Sonraki ödemeler için kartımı sakla

# makePayment
source: Confirm Payment
az: Ödəniş Edin
ru: Оплатить
tr: Ödeme Yap

# multipleCredit
source: Multiple Credit Cards
az: Birdən Çox Kredit Kartı
ru: Несколько Кредитных Карт
tr: Çoklu Kredi Kartı

# firstCardAmount
source: Amount to be withdrawn from the first card
az: Birinci kartdan çıxarılacaq məbləğ
ru: Сумма с первой карты
tr: İlk karttan çekilecek tutar

# secondCardAmount
source: Amount to be withdrawn from the second card
az: İkinci kartdan çıxarılacaq məbləğ
ru: Сумма со второй карты
tr: İkinci karttan çekilecek tutar

# oderoLicense
source: Copyright © 2022 Token Payment Services and Electronic Money Inc. All rights reserved.
az: Copyright © 2022 Token Azərbaycan MMC. Bütün hüquqlar qorunur.
ru: Copyright © OOO "Token Azerbaijan" 2022. Все права защищены.
tr: Copyright © 2022 Token Ödeme Hizmetleri ve Elektronik Para A.Ş. All rights reserved.

# paymentSuccess
source: Payment is received!
az: Ödəniş alındı!
ru: Платеж принят!
tr: Ödemeniz alındı!

# paymentError
source: Payment not received
az: Ödəniş alınmadı
ru: Платеж не прошел
tr: Ödeme alınamadı

# paymentErrorHelp
source: The transaction was not approved by the bank, please check the information you entered.
az: Əməliyyat bank tərəfindən təsdiqlənməyib, daxil etdiyiniz məlumatları yoxlayın. Daxil etdiyiniz məlumatlardan əminsinizsə, bankınızla əlaqə saxlaya bilərsiniz.
ru: Транзакция не была одобрена банком, пожалуйста, проверьте введенную вами информацию.
tr: İşlem banka tarafından onaylanmadı, girdiğiniz bilgileri kontrol ediniz.

# paymentErrorHelp2
source: If you are sure of the information you entered, you can contact your bank.
ru: Если вы уверены в введенной вами информации, вы можете обратиться в свой банк.
tr: Girdiğiniz bilgilerden eminseniz bankanız ile iletişime geçebilirsiniz.

# returnToCheckout
source: Return to Checkout Page
az: Ödəniş Səhifəsinə Qayıdın
ru: Вернуться
tr: Ödeme Sayfasına Dön

# returnToHome
source: returning to home screen...
az: ana ekranına qayıdır...
ru: возврат на главный экран...
tr: ana sayfaya dönülüyor...

# payWithOdero
source: Pay with
az: ilə ödə
ru: Оплатить с
tr: İle öde

source: Next
az: Növbəti
ru: Далее
tr: Sonraki

source: Previous
az: Əvvəlki
ru: Назад
tr: Öncesi

source: Network Error
az: Şəbəkə Xətası
ru: Сетевая ошибка
tr: Network Hatası

source: Internal Error
az: Daxili Xəta
ru: Внутренняя ошибка
tr: İç Hatası

# serverError
source: OderoPay Server Error
az: OderoPay Server Xətası
ru: Серверная ошибка OderoPay
tr: OderoPay Server Hatası

# missingError
source: Missing Data Error
az: Çatışmayan Məlumat Xətası
ru: Недостающие параметры
tr: Eksik Bilgiler Hatası

source: Unknown Error
az: Naməlum Xəta
ru: Неизвестная ошибка
tr: Bilinmeyen Hata

# insufficientFundsError
source: Insufficient Funds
ru: Недостаточно средств

# laterErrorDescription
source: Something went wrong. Please try again later.
az: Xəta baş verdi. Zəhmət olmasa bir az sonra yenə cəhd edin.
ru: Что-то пошло не так. Попробуйте снова позже.
tr: Bir şeyler yanlış gitti. Lütfen daha sonra tekrar deneyiniz.

# errorDescription
source: Something went wrong. Please try again.
az: Xəta baş verdi. Yenidən cəhd edin.
ru: Что-то пошло не так. Попробуйте снова.
tr: Bir şeyler yanlış gitti. Lütfen tekrar deneyin.

# cardErrorDescription
source: Provided card information is invalid.
ru: Предоставленные данные карты недействительны.

# fundsDescription
source: You don't have enough funds to complete this transaction.
ru: На вашем балансе не хватает средств для осуществления транзакции
